/**
 
 ビーカーに注がれる液体の水嵩で測る時計
 １秒で１メモリ,時間が経つにつれて色が変わっていく
 
 */

int iW;

void setup()
{
  frameRate(60);//フレームレートを60に設定
  size(600, 600);//サイズを600×600に設定
  colorMode(HSB, 360, 100, 100, 100);//カラーモードをRGBに設定
  background(0);//背景色

  iW = 0;
}

void draw()
{

  //画面リフレッシュ-----------------------------
  fill(0);
  rect(0, 0, width, height);

  //ビーカー-------------------------------------
  fill(255);
  noStroke();
  rectMode(CORNERS);
  rect(200, 300, 400, 565);
  rect(185, 290, 400, 300);

  fill(255);
  noStroke();
  rectMode(CORNERS);
  rect(200, 300, 400, 565);
  rect(185, 290, 400, 300);


  //水滴の描画------------------------------------

  translate(0, 365);//振動の中心を移動
  iW += 3;         //角度は3°ずつ上がって行く
  fill(125, 80, 275);
  circle(width/2, -185*cos(radians(iW)), 12.5);    //振幅185,振動の中心(300,365)の単振動

  //180°を超えると0°に戻る
  if (iW > 180)
  {
    iW = 0;
  }

  //座標リセット-----------------------------------
  translate(0, -365);

  //時計-------------------------------------------

  //秒刻み

  int s = second();
  int m = minute();


  float iX = 560-4.5*s;    //１秒ごとに１メモリずつ上がっていくiX

  noStroke();
  fill(m*6, 40, 90);   //１分ごとにHSBのHの値が6°ずつ上がる
  rect(395, 560, 205, iX);


  //メモリ
  stroke(0);
  strokeWeight(1.5);
  line(200, 537.5, 210, 537.5);
  line(200, 515, 215, 515);
  line(200, 492.5, 210, 492.5);
  line(200, 470, 215, 470);
  line(200, 447.5, 210, 447.5);
  line(200, 425, 215, 425);
  line(200, 402.5, 210, 402.5);
  line(200, 380, 215, 380);
  line(200, 357.5, 210, 357.5);
  line(200, 335, 215, 335);
  line(200, 312.5, 210, 312.5);


  //メモリ文字
  fill(0);
  textSize(12.5);
  textAlign(CENTER);
  text(10, 225, 515);
  text(20, 225, 470);
  text(30, 225, 425);
  text(40, 225, 380);
  text(50, 225, 335);

  //１分ごとに泡のアニメーション


  //試験管-----------------------------------------
  fill(255);
  translate(285, 100);
  rotate(radians(75));
  noStroke();
  rect(10, 10, 60, 355);
  rect(5, 5, 65, 12);

  //試験管液体
  noStroke();
  fill(125, 80, 275);
  triangle(12, 265, 58, 5, 58, 10000);

  //試験管メモリ
  stroke(0);
  line(10, 332.5, 20, 332.5);
  line(10, 310, 20, 310);
  line(10, 287.5, 20, 287.5);
  line(10, 265, 20, 265);
  line(10, 242.5, 20, 242.5);
  line(10, 220, 20, 220);
  line(10, 197.5, 20, 197.5);
  line(10, 175, 20, 175);
  line(10, 152.5, 20, 152);
  line(10, 130, 20, 130);
  line(10, 107.5, 20, 107.5);
  line(10, 85, 20, 85);
  line(10, 62.5, 20, 62.5);
  line(10, 40, 20, 40);
  line(10, 17.5, 20, 17.5);
}
