/**************************************************************
この作品を描くモチーフは落ち葉、扇子と水の波紋です。
落ち葉がある季節になって、観察するとそれぞれ色が違い、でも大体黄色いのイメージです。
木の下の水面も空やその黄色いを反射して、水の波紋の色も変わります。
扇子の形で作る理由は、このシーンで日本風情を入れたいからです。
 **************************************************************/
size(500, 500);      // Window Size

// -----------------------------------
// Edit Here
background(255); 
for ( int iSize = 600; iSize > 0; iSize -= 100 )//円を書きます
{
  stroke(random(200, 255), random(200, 255), random(50, 150));
  fill(random(200, 255), random(200, 255), random(50, 150),10);//淡い黄色　透明度低い
  circle( 250, 250, iSize );
}

for (int iX = 24; iX < 600; iX += 65) {
  for (int iY = 50; iY < 600; iY += 75) {
    
    strokeWeight(3);
    stroke(random(200, 255), random(200, 255), random(50, 150));//淡い黄色
     fill(random(200, 255), random(200, 255), random(50, 150));//淡い黄色
     
    arc(iX, iY, 75, 75, radians(215), radians(325), PIE);//大きいarc
   
    arc(iX, iY, 50, 30, radians(225), radians(315), PIE);//小さいarc
   
     fill(random(200, 255), random(200, 255), random(50, 150));//淡い黄色
     
    line(iX,iY,iX+5,iY+6);//交差点から 右下に行く短い線
    line(iX,iY,iX-5,iY+6);//左上に行く短い線
    
    line(iX,iY,iX+10,iY-20);//右上に行く線
    line(iX,iY,iX-10,iY-20);//左上に行く線
    
    line(iX,iY,iX+30,iY+5);//右下に行く長い線
    line(iX,iY,iX-30,iY+5);//左下に行く長い線
  }
}
// -----------------------------------


// -----------------------------------
// "K2_[クラス][番号]_[苗字].png"
save("K2_A12_fukushima.png");
// -----------------------------------
