/**************************************************************
水の張ったタイル調のプールを表現した。
水中のタイル線はcurveを用い、光の屈折による歪みを表現した。
水面の光の揺らぎはランダムで生成するごとに変化する。
 **************************************************************/
size(500, 500);      // Wandow Saze

// -----------------------------------
colorMode(HSB,360,100,100);
background(#fffff0);

strokeWeight(3);
stroke(0);

//タイル縦線
for( int a =20; a <500 ; a +=50-a/20)
{
  line(a,0, a,300-a/3);
}

//タイル横線
for( int b =1; b<300 ; b+=40)
{
  line(0,b, 1260,-100);
}

//水面
 fill(#c3ecdb);
 noStroke();
 for( int h =0; h<500; h+=50-h/20)
 {
  quad(h,280-h/3.3, h,500, h+50,500,h+50,(280-h/3.3)-15);
 }
 
 //水中のタイル横線
 stroke(0,60);
for(int c =281 ; c<500 ; c+=40)
{
  line(0,c,1260,-100);
}
 //水中のタイル縦線
 stroke(0,60);
 noFill();
for( int d =20; d <500 ; d+=50-d/20)
{
  curve(0,0, d,280-d/3.3, d,500-d/2, 500-d/10,500-d/3);
}

//水底タイル横線
 stroke(0,60);
for(int e=20; e<500 ; e+=50-e/20)
 {
   line(e,500-e/2,600,500-e/2);
 }
 
//水底タイル縦線
for(int f =521 ; f<1000 ; f+=40)
{
  line(0,f,1260,-100);
}

//光
blendMode( ADD );
stroke(20);
strokeWeight(random(10,30));

for( int i = 0; i < 90; i++ )
{
  fill(random(180,240),random(100),random(50),random(100));
  ellipse( random( 0,500 ), random( 100,500 ), random( 50,90 ),random( 10, 50 ) );
}

// -----------------------------------


// -----------------------------------
// "K2_[クラス][番号]_[苗字].png"
save("K2_A12_Fukushima.png");
// -----------------------------------
