void densyanaisou(){
  noStroke();
  fill( 21, 67, 110 );//背景
  rect( 0, 0, 600, 150 );
  rect( 0, 450, 600, 150 );
  fill( 180 );//窓枠
  rect( 0, 140, 600, 10 );
  rect( 0, 450, 600, 10 );
  fill( 15, 135, 148 );//椅子
  rect( 0, 460, 600, 95 );
  fill( 0, 120, 133 );
  rect( 0, 460, 600, 5 );
  fill( 0, 120, 133 );
  rect( 0, 530, 600, 5 );
  fill( 5, 125, 138 );
  rect( 0, 555, 600, 40 );
  fill( 1, 47, 90 );//荷物置き場
  rect( 0, 90, 600, 10 );
  fill( 0, 27, 70 );//鞄
  circle( 505, 60, 60 );
  fill( 21, 67, 110 );
  circle( 505, 60, 40 );
  fill( 0, 27, 70 );
  rect( 470, 50, 70, 40 );
  
}
